posts/vega-lite-clj.html

  <section class="flex flex-col max-w-full mt-0 prose lg:flex-row dark:prose-invert">
    <div class="min-w-0 min-h-0 max-w-prose">
      
<div id="outline-container-orgf94692a" class="outline-2">
<h2 id="orgf94692a">Discovering Vega-lite</h2>
<div class="outline-text-2" id="text-orgf94692a">
<p>
I am in the middle of my journey discovering Clojure and its ecosystem of libraries.
So far I have explored quite thoroughly the areas of Data Science (most notable mention: <code>tech.ml.dataset</code>) and R/Python interoperability (mentions: <code>libpython-clj</code> and <code>clojisr</code>).
The incredible developers behind these libraries often discuss about data visualization and they seem fond of one "framework" in particular, and that is Vega-Lite.
</p>

<p>
Of course, there is a particularly popular Clojure library for manipulating visualizations and that is <code>Oz</code>.
Out of curiousity, I have watched the canonical <a href="https://www.youtube.com/watch?v=9uaHRWj04D4">introductory video</a> to Vega-Lite and I was really amazed by its simplicity and power of expression.
In brief:
</p>
<ul class="org-ul">
<li>Vega is designed by following guidelines outlined in the Grammar of Graphics</li>
<li>Vega is built "on top" of <code>d3.js</code></li>
<li>Vega-lite is a "lighter" version of Vega, less verbose and with "sane defaults"</li>
</ul>

<p>
After reading about it and experimenting with it, I understand why the smart people of the Clojure community are fascinated by this library.
Consider this plot:
</p>
<div> <svg class="marks" width="350" height="247" viewBox="0 0 350 247" style="background-color: white;"><defs><style>.vega-svg-root * { fill: none; } .vega-svg-root tspan { fill: inherit; } .vega-svg-root path { stroke-miterlimit: 10; }</style></defs><g class="vega-svg-root" transform="translate(44,10)"><g class="mark-group role-frame root" role="graphics-object" aria-roledescription="group mark container"><g transform="translate(0,0)"><path class="background" aria-hidden="true" d="M0.5,0.5h300v200h-300Z" style="fill: transparent; stroke: rgb(221, 221, 221);"></path><g><g class="mark-group role-axis" aria-hidden="true"><g transform="translate(0.5,0.5)"><path class="background" aria-hidden="true" d="M0,0h0v0h0Z" style="pointer-events: none;"></path><g><g class="mark-rule role-axis-grid" style="pointer-events: none;"><line transform="translate(0,200)" x2="300" y2="0" style="stroke: rgb(221, 221, 221); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,150)" x2="300" y2="0" style="stroke: rgb(221, 221, 221); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,100)" x2="300" y2="0" style="stroke: rgb(221, 221, 221); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,50)" x2="300" y2="0" style="stroke: rgb(221, 221, 221); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,0)" x2="300" y2="0" style="stroke: rgb(221, 221, 221); stroke-width: 1px; opacity: 1;"></line></g></g><path class="foreground" aria-hidden="true" d="" style="pointer-events: none; display: none;"></path></g></g><g class="mark-group role-axis" role="graphics-symbol" aria-roledescription="axis" aria-label="X-axis titled 'Day' for a discrete scale with 15 values: 1, 2, 3, 4, 5, ending with 15"><g transform="translate(0.5,200.5)"><path class="background" aria-hidden="true" d="M0,0h0v0h0Z" style="pointer-events: none;"></path><g><g class="mark-rule role-axis-tick" style="pointer-events: none;"><line transform="translate(10,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(30,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(50,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(70,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(90,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(110,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(130,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(150,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(170,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(190,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(210,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(230,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(250,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(270,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(290,0)" x2="0" y2="5" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line></g><g class="mark-text role-axis-label" style="pointer-events: none;"><text text-anchor="middle" transform="translate(9.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">1</text><text text-anchor="middle" transform="translate(29.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">2</text><text text-anchor="middle" transform="translate(49.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">3</text><text text-anchor="middle" transform="translate(69.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">4</text><text text-anchor="middle" transform="translate(89.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">5</text><text text-anchor="middle" transform="translate(109.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">6</text><text text-anchor="middle" transform="translate(129.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">7</text><text text-anchor="middle" transform="translate(149.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">8</text><text text-anchor="middle" transform="translate(169.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">9</text><text text-anchor="middle" transform="translate(189.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">10</text><text text-anchor="middle" transform="translate(209.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">11</text><text text-anchor="middle" transform="translate(229.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">12</text><text text-anchor="middle" transform="translate(249.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">13</text><text text-anchor="middle" transform="translate(269.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">14</text><text text-anchor="middle" transform="translate(289.5,15)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">15</text></g><g class="mark-rule role-axis-domain" style="pointer-events: none;"><line transform="translate(0,0)" x2="300" y2="0" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line></g><g class="mark-text role-axis-title" style="pointer-events: none;"><text text-anchor="middle" transform="translate(150,30)" style="font-family: sans-serif; font-size: 11px; font-weight: bold; fill: rgb(0, 0, 0); opacity: 1;">Day</text></g></g><path class="foreground" aria-hidden="true" d="" style="pointer-events: none; display: none;"></path></g></g><g class="mark-group role-axis" role="graphics-symbol" aria-roledescription="axis" aria-label="Y-axis titled 'PM2.5 Value' for a linear scale with values from 0 to 400"><g transform="translate(0.5,0.5)"><path class="background" aria-hidden="true" d="M0,0h0v0h0Z" style="pointer-events: none;"></path><g><g class="mark-rule role-axis-tick" style="pointer-events: none;"><line transform="translate(0,200)" x2="-5" y2="0" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,150)" x2="-5" y2="0" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,100)" x2="-5" y2="0" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,50)" x2="-5" y2="0" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line><line transform="translate(0,0)" x2="-5" y2="0" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line></g><g class="mark-text role-axis-label" style="pointer-events: none;"><text text-anchor="end" transform="translate(-7,203)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">0</text><text text-anchor="end" transform="translate(-7,153)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">100</text><text text-anchor="end" transform="translate(-7,103)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">200</text><text text-anchor="end" transform="translate(-7,53)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">300</text><text text-anchor="end" transform="translate(-7,3)" style="font-family: sans-serif; font-size: 10px; fill: rgb(0, 0, 0); opacity: 1;">400</text></g><g class="mark-rule role-axis-domain" style="pointer-events: none;"><line transform="translate(0,200)" x2="0" y2="-200" style="stroke: rgb(136, 136, 136); stroke-width: 1px; opacity: 1;"></line></g><g class="mark-text role-axis-title" style="pointer-events: none;"><text text-anchor="middle" transform="translate(-27.701492309570312,100) rotate(-90) translate(0,-2)" style="font-family: sans-serif; font-size: 11px; font-weight: bold; fill: rgb(0, 0, 0); opacity: 1;">PM2.5 Value</text></g></g><path class="foreground" aria-hidden="true" d="" style="pointer-events: none; display: none;"></path></g></g><g class="mark-rect role-mark layer_0_layer_0_marks" role="graphics-object" aria-roledescription="rect mark container"><path aria-label="Day: 1; Value: 54.8" role="graphics-symbol" aria-roledescription="bar" d="M1,172.6h18v27.400000000000006h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 2; Value: 112.1" role="graphics-symbol" aria-roledescription="bar" d="M21,143.95h18v56.05000000000001h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 3; Value: 63.6" role="graphics-symbol" aria-roledescription="bar" d="M41,168.2h18v31.80000000000001h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 4; Value: 37.6" role="graphics-symbol" aria-roledescription="bar" d="M61,181.20000000000002h18v18.799999999999983h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 5; Value: 79.7" role="graphics-symbol" aria-roledescription="bar" d="M81,160.15h18v39.849999999999994h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 6; Value: 137.9" role="graphics-symbol" aria-roledescription="bar" d="M101,131.05h18v68.94999999999999h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 7; Value: 120.1" role="graphics-symbol" aria-roledescription="bar" d="M121,139.95000000000002h18v60.04999999999998h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 8; Value: 103.3" role="graphics-symbol" aria-roledescription="bar" d="M141,148.35h18v51.650000000000006h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 9; Value: 394.8" role="graphics-symbol" aria-roledescription="bar" d="M161,2.6000000000000023h18v197.4h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 10; Value: 199.5" role="graphics-symbol" aria-roledescription="bar" d="M181,100.25h18v99.75h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 11; Value: 72.3" role="graphics-symbol" aria-roledescription="bar" d="M201,163.85h18v36.150000000000006h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 12; Value: 51.1" role="graphics-symbol" aria-roledescription="bar" d="M221,174.45h18v25.55000000000001h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 13; Value: 112" role="graphics-symbol" aria-roledescription="bar" d="M241,144h18v56h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 14; Value: 174.5" role="graphics-symbol" aria-roledescription="bar" d="M261,112.75h18v87.25h-18Z" style="fill: rgb(76, 120, 168);"></path><path aria-label="Day: 15; Value: 130.5" role="graphics-symbol" aria-roledescription="bar" d="M281,134.75h18v65.25h-18Z" style="fill: rgb(76, 120, 168);"></path></g><g class="mark-rect role-mark layer_0_layer_1_marks" role="graphics-object" aria-roledescription="rect mark container"><path aria-label="Day: 9; PM2.5 Value: 300; Value: 394.8" role="graphics-symbol" aria-roledescription="bar" d="M161,2.6000000000000023h18v47.4h-18Z" style="fill: rgb(228, 87, 85);"></path></g><g class="mark-rule role-mark layer_1_layer_0_marks" role="graphics-symbol" aria-roledescription="rule mark container"><line transform="translate(300,50)" x2="-300" y2="0" style="stroke: black;"></line></g><g class="mark-text role-mark layer_1_layer_1_marks" role="graphics-object" aria-roledescription="text mark container"><text text-anchor="end" transform="translate(298,46)" style="font-family: sans-serif; font-size: 11px; fill: black;">hazardous</text></g></g><path class="foreground" aria-hidden="true" d="" style="display: none;"></path></g></g></g></svg> </div>

<p>
This is the plot specification, described in JSON:
</p>
<div class="org-src-container">
<pre class="src src-js">{
  <span class="org-string">"$schema"</span>: <span class="org-string">"https://vega.github.io/schema/vega-lite/v4.json"</span>,
  <span class="org-string">"description"</span>: <span class="org-string">"The PM2.5 value of Beijing observed 15 days, highlighting the days when PM2.5 level is hazardous to human health. Data source https://chartaccent.github.io/chartaccent.html"</span>,
    <span class="org-string">"layer"</span>: [{
      <span class="org-string">"data"</span>: {
        <span class="org-string">"values"</span>: [
          {<span class="org-string">"Day"</span>: 1, <span class="org-string">"Value"</span>: 54.8},
          {<span class="org-string">"Day"</span>: 2, <span class="org-string">"Value"</span>: 112.1},
          {<span class="org-string">"Day"</span>: 3, <span class="org-string">"Value"</span>: 63.6},
          {<span class="org-string">"Day"</span>: 4, <span class="org-string">"Value"</span>: 37.6},
          {<span class="org-string">"Day"</span>: 5, <span class="org-string">"Value"</span>: 79.7},
          {<span class="org-string">"Day"</span>: 6, <span class="org-string">"Value"</span>: 137.9},
          {<span class="org-string">"Day"</span>: 7, <span class="org-string">"Value"</span>: 120.1},
          {<span class="org-string">"Day"</span>: 8, <span class="org-string">"Value"</span>: 103.3},
          {<span class="org-string">"Day"</span>: 9, <span class="org-string">"Value"</span>: 394.8},
          {<span class="org-string">"Day"</span>: 10, <span class="org-string">"Value"</span>: 199.5},
          {<span class="org-string">"Day"</span>: 11, <span class="org-string">"Value"</span>: 72.3},
          {<span class="org-string">"Day"</span>: 12, <span class="org-string">"Value"</span>: 51.1},
          {<span class="org-string">"Day"</span>: 13, <span class="org-string">"Value"</span>: 112.0},
          {<span class="org-string">"Day"</span>: 14, <span class="org-string">"Value"</span>: 174.5},
          {<span class="org-string">"Day"</span>: 15, <span class="org-string">"Value"</span>: 130.5}
        ]
      },
      <span class="org-string">"layer"</span>: [{
        <span class="org-string">"mark"</span>: <span class="org-string">"bar"</span>,
        <span class="org-string">"encoding"</span>: {
          <span class="org-string">"x"</span>: {<span class="org-string">"field"</span>: <span class="org-string">"Day"</span>, <span class="org-string">"type"</span>: <span class="org-string">"ordinal"</span>, <span class="org-string">"axis"</span>: {<span class="org-string">"labelAngle"</span>: 0}},
          <span class="org-string">"y"</span>: {<span class="org-string">"field"</span>: <span class="org-string">"Value"</span>, <span class="org-string">"type"</span>: <span class="org-string">"quantitative"</span>}
        }
      }, {
        <span class="org-string">"mark"</span>: <span class="org-string">"bar"</span>,
        <span class="org-string">"transform"</span>: [
          {<span class="org-string">"filter"</span>: <span class="org-string">"datum.Value &gt;= 300"</span>},
          {<span class="org-string">"calculate"</span>: <span class="org-string">"300"</span>, <span class="org-string">"as"</span>: <span class="org-string">"baseline"</span>}
        ],
        <span class="org-string">"encoding"</span>: {
          <span class="org-string">"x"</span>: {<span class="org-string">"field"</span>: <span class="org-string">"Day"</span>, <span class="org-string">"type"</span>: <span class="org-string">"ordinal"</span>},
          <span class="org-string">"y"</span>: {<span class="org-string">"field"</span>: <span class="org-string">"baseline"</span>, <span class="org-string">"type"</span>: <span class="org-string">"quantitative"</span>, <span class="org-string">"title"</span>: <span class="org-string">"PM2.5 Value"</span>},
          <span class="org-string">"y2"</span>: {<span class="org-string">"field"</span>: <span class="org-string">"Value"</span>},
          <span class="org-string">"color"</span>: {<span class="org-string">"value"</span>: <span class="org-string">"#e45755"</span>}
        }
      }
    ]}, {
      <span class="org-string">"data"</span>: {
         <span class="org-string">"values"</span>: [{}]
      },
      <span class="org-string">"encoding"</span>: {
        <span class="org-string">"y"</span>: {<span class="org-string">"datum"</span>: 300}
      },
      <span class="org-string">"layer"</span>: [{
        <span class="org-string">"mark"</span>: <span class="org-string">"rule"</span>
      }, {
        <span class="org-string">"mark"</span>: {
          <span class="org-string">"type"</span>: <span class="org-string">"text"</span>,
          <span class="org-string">"align"</span>: <span class="org-string">"right"</span>,
          <span class="org-string">"baseline"</span>: <span class="org-string">"bottom"</span>,
          <span class="org-string">"dx"</span>: -2,
          <span class="org-string">"dy"</span>: -2,
          <span class="org-string">"x"</span>: <span class="org-string">"width"</span>,
          <span class="org-string">"text"</span>: <span class="org-string">"hazardous"</span>
        }
      }]
    }
  ]
}
</pre>
</div>

<p>
It is not the simplest example but I think it speaks great of Vega-Lite expressiveness.
The visualization is divided in two layers and each layer has two sublayers:
</p>
<ul class="org-ul">
<li>The first layer has simple data associated with it, with the fields "Day" and "Value"
<ul class="org-ul">
<li>The first sublayer has a mark specifying a "bar" plot</li>
<li>The field "Day" is encoded to the x axis and "Value" to the y axis</li>
<li>The second sublayer is another bar mark with defines transforms:
<ul class="org-ul">
<li>Data below 300 is filtered and 300 is defined as baseline</li>
<li>In the encoding there is y, which is the defined baseline</li>
<li>There is also y2, which is the values above 300 that we filtered, colored of red</li>
</ul></li>
</ul></li>
<li>The second layer has no data but a fixed y encoding to 300
<ul class="org-ul">
<li>The first sublayer has mark "rule", which draws an horizontal line in y</li>
<li>The second sublayer has mark "text" and the options describe positioning</li>
</ul></li>
</ul>

<p>
I really like this way of composing a visualization.
It is very simple to express the components and quite intuitive how to layer them together.
</p>
</div>
</div>
