posts/vega-lite-clj.org
* Oz
Well, Vega-lite is nothing new, might not be so exciting for the majority of people.
What makes it extremely interesting for me is that it has something in common with Clojure: this visualization spec is just data.
Instead of JSON, it can be represented in YAML or EDN. In fact, it's nothing more than a map of vectors and maps.

The library called ~Oz~ allows us to define a Vega-Lite spec in Clojure, it compiles it to vega and renders it in a browser with minimal effort.
It even allows us to export the plot to a self-contained HTML using the javascript library ~vega-embed~.

Consider this neat code found in the repo's README:
#+BEGIN_SRC clojure
(ns org.core
  (:require [oz.core :as oz]))

(defn play-data [& names]
  (for [n names
        i (range 20)]
    {:time i :item n :quantity (+ (Math/pow (* i (count n)) 0.8) (rand-int (count n)))}))

(def line-plot
  {:data     {:values (play-data "monkey" "slipper" "broom")}
   :encoding {:x     {:field "time" :type "quantitative"}
              :y     {:field "quantity" :type "quantitative"}
              :color {:field "item" :type "nominal"}}
   :mark     "line"})

(oz/export! line-plot "public/html/line.html")
#+END_SRC

Here 3 random time series are generated, encoded in the most obvious, concise, simple way and the result is what you would expect:
#+BEGIN_EXPORT html
<iframe src="../static/html/line.html" style="overflow:visible;min-height:300px;height:100%;width:100%;padding:20px" scrolling="no" border="none" width="100%" height="100%" marginheight="0" frameborder="0"></iframe>
#+END_EXPORT

What I love about this example is that you work with raw, naked data.
There is no class, no weird API syntax or function kwargs to memorize.

* Blog development:
Anoter interesting learning I had was how to embed Vega into this blog!
Because I don't know enough about web development, it took me way more than it should have.
Actually, it was really easy since you can just write plain HTML in markdown and that will be correctly parsed by ~markdown.core~ and ~reagent~.

When taking a compiled Vega spec, I can just put the SVG in a div tag.
When exporting it from Clojure, I can put the HTML file in an iframe.
It is just a bit annoying that this does not resize automatically but I can control it with the CSS attribute ~min-height~ and set it to the height I specify in Vega-lite.

Oz also has a facility to render a Reagent component directly from Clojure.
At the moment I am not using it as my blog posts are written in markdown/HTML, I could use it to populate another page of the website.

As a final cherry on top, writing my blog in Org mode has already shown its value.
Executing ~yarn develop~ starts the ~shadow-cljs~ server which will watch for changed files.
At the same time it will expose a Clojure REPL that I can connect to in order to execute my org src blocks.
When I am satisfied, I can just export to markdown and see the blog post reloading.
