posts/vega-lite-clj.html

<div id="outline-container-org1a3ba6d" class="outline-2">
<h2 id="org1a3ba6d">Oz</h2>
<div class="outline-text-2" id="text-org1a3ba6d">
<p>
Well, Vega-lite is nothing new, might not be so exciting for the majority of people.
What makes it extremely interesting for me is that it has something in common with Clojure: this visualization spec is just data.
Instead of JSON, it can be represented in YAML or EDN. In fact, it's nothing more than a map of vectors and maps.
</p>

<p>
The library called <code>Oz</code> allows us to define a Vega-Lite spec in Clojure, it compiles it to vega and renders it in a browser with minimal effort.
It even allows us to export the plot to a self-contained HTML using the javascript library <code>vega-embed</code>.
</p>

<p>
Consider this neat code found in the repo's README:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span class="org-keyword">ns</span> <span class="org-type">org.core</span>
  (<span class="org-clojure-keyword">:require</span> [oz.core <span class="org-clojure-keyword">:as</span> oz]))

(<span class="org-keyword">defn</span> <span class="org-function-name">play-data</span> [&amp; names]
  (<span class="org-keyword">for</span> [n names
        i (range 20)]
    {<span class="org-clojure-keyword">:time</span> i <span class="org-clojure-keyword">:item</span> n <span class="org-clojure-keyword">:quantity</span> (+ (<span class="org-type">Math</span>/pow (* i (count n)) 0.8) (rand-int (count n)))}))

(<span class="org-keyword">def</span> <span class="org-variable-name">line-plot</span>
  {<span class="org-clojure-keyword">:data</span>     {<span class="org-clojure-keyword">:values</span> (play-data <span class="org-string">"monkey"</span> <span class="org-string">"slipper"</span> <span class="org-string">"broom"</span>)}
   <span class="org-clojure-keyword">:encoding</span> {<span class="org-clojure-keyword">:x</span>     {<span class="org-clojure-keyword">:field</span> <span class="org-string">"time"</span> <span class="org-clojure-keyword">:type</span> <span class="org-string">"quantitative"</span>}
              <span class="org-clojure-keyword">:y</span>     {<span class="org-clojure-keyword">:field</span> <span class="org-string">"quantity"</span> <span class="org-clojure-keyword">:type</span> <span class="org-string">"quantitative"</span>}
              <span class="org-clojure-keyword">:color</span> {<span class="org-clojure-keyword">:field</span> <span class="org-string">"item"</span> <span class="org-clojure-keyword">:type</span> <span class="org-string">"nominal"</span>}}
   <span class="org-clojure-keyword">:mark</span>     <span class="org-string">"line"</span>})

(<span class="org-type">oz</span>/export! line-plot <span class="org-string">"public/html/line.html"</span>)
</pre>
</div>

<p>
Here 3 random time series are generated, encoded in the most obvious, concise, simple way and the result is what you would expect:
</p>
<iframe src="../static/html/line.html" style="overflow:visible;min-height:300px;height:100%;width:100%;padding:20px" scrolling="no" border="none" width="100%" height="100%" marginheight="0" frameborder="0"></iframe>

<p>
What I love about this example is that you work with raw, naked data.
There is no class, no weird API syntax or function kwargs to memorize.
</p>
</div>
</div>

<div id="outline-container-orgaed0d7a" class="outline-2">
<h2 id="orgaed0d7a">Blog development:</h2>
<div class="outline-text-2" id="text-orgaed0d7a">
<p>
Anoter interesting learning I had was how to embed Vega into this blog!
Because I don't know enough about web development, it took me way more than it should have.
Actually, it was really easy since you can just write plain HTML in markdown and that will be correctly parsed by <code>markdown.core</code> and <code>reagent</code>.
</p>

<p>
When taking a compiled Vega spec, I can just put the SVG in a div tag.
When exporting it from Clojure, I can put the HTML file in an iframe.
It is just a bit annoying that this does not resize automatically but I can control it with the CSS attribute <code>min-height</code> and set it to the height I specify in Vega-lite.
</p>

<p>
Oz also has a facility to render a Reagent component directly from Clojure.
At the moment I am not using it as my blog posts are written in markdown/HTML, I could use it to populate another page of the website.
</p>

<p>
As a final cherry on top, writing my blog in Org mode has already shown its value.
Executing <code>yarn develop</code> starts the <code>shadow-cljs</code> server which will watch for changed files.
At the same time it will expose a Clojure REPL that I can connect to in order to execute my org src blocks.
When I am satisfied, I can just export to markdown and see the blog post reloading.
</p>
</div>
</div>

    </div>
  </section>

  <section>
    <div id="hyvor-talk-view"></div>
    <hyvor-talk-comments website-id="793" page-id="vega-lite-clj"></hyvor-talk-comments>
  </section>

  <!-- <div class="absolute top-[110vh] ltr:right-0 rtl:left-0 w-12 pointer-events-none bottom-[-5.5rem]"> -->
  <!--   <a href="#the-top" class="w-12 h-12 sticky pointer-events-auto top-[calc(100vh-5rem)] bg-neutral/50 dark:bg-neutral-800/50 backdrop-blur rounded-full text-xl flex items-center justify-center text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400" aria-label="Scroll to top" title="Scroll to top">↑</a> -->
  <!-- </div> -->

</article>

    </main>

    <footer class="py-10 print:hidden">
      
      <div class="flex justify-between">
  <div>
    <p class="text-sm text-neutral-500 dark:text-neutral-400">&copy;
      Luca Cambiaghi
    </p>
    <p class="text-xs text-neutral-500 dark:text-neutral-400">Theme inspired by
      <a class="hover:underline hover:decoration-primary-400 hover:text-primary-500" href="https://git.io/hugo-congo" target=_blank rel="noopener noreferrer">Congo</a>
    </p>
  </div>
  <div class="text-sm cursor-pointer text-neutral-700 dark:text-neutral hover:text-primary-600 dark:hover:text-primary-400 ltr:mr-14 rtl:ml-14">
    <button id=appearance-switcher class="w-12 h-12" type=button title="Switch to dark appearance">
      <span class="inline dark:hidden"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M32 256C32 132.2 132.3 32 255.8 32c11.36.0 29.7 1.668 40.9 3.746 9.616 1.777 11.75 14.63 3.279 19.44C245 86.5 211.2 144.6 211.2 207.8c0 109.7 99.71 193 208.3 172.3 9.561-1.805 16.28 9.324 10.11 16.95C387.9 448.6 324.8 480 255.8 480 132.1 480 32 379.6 32 256z"/></svg></span></span><span class="hidden dark:inline"><span class="relative inline-block align-text-bottom icon"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentcolor" d="M256 159.1c-53.02.0-95.1 42.98-95.1 95.1s41.2 96.9 95.1 96.9 95.1-42.98 95.1-95.1S309 159.1 256 159.1zM509.3 347l-63.2-91.9 63.15-91.01c6.332-9.125 1.104-21.74-9.826-23.72l-109-19.7-19.7-109c-1.975-10.93-14.59-16.16-23.72-9.824L256 65.89 164.1 2.736c-9.125-6.332-21.74-1.107-23.72 9.824L121.6 121.6 12.56 141.3C1.633 143.2-3.596 155.9 2.736 164.1L65.89 256 2.74 347.01c-6.332 9.125-1.105 21.74 9.824 23.72l109 19.7 19.7 109c1.975 10.93 14.59 16.16 23.72 9.824L256 446.1l91.01 63.15c9.127 6.334 21.75 1.107 23.72-9.822l19.7-109 109-19.7C510.4 368.8 515.6 356.1 509.3 347zM256 383.1c-70.69.0-127.1-57.31-127.1-127.1.0-70.69 57.31-127.1 127.1-127.1S383.1 186.2 383.1 256c0 70.7-56.4 127.1-127.1 127.1z"/></svg></span></span></button></div></div>

      
    </footer>

  </body>
</html>
